src/21math401/KBe21math401retFunctionsDefinition.org
#+AUTHOR: Exr0n
* What is a function?
  A function $f : D \to C$ is a unary operation that takes every element in the domain $D$ to exactly one element in the codomain $C$.

  $f(x) = x^2$ is a function over the domain of reals.
* A 1:1 function or injective function
  A bijective function is a function $f$ for which there exists a function $g$ such that $g\left(f(x)\right) = x$ for all $x \in D$.
  For every input, there is exactly one output, and for every output, there is exactly one input.

  $f(x) = x^2$ is not a 1:1 function, because both $-1^2 = 1$ and $1^2 = 1$.
* What is an inverse function
  An inverse function $g : C \to D$ is a function such that $g(f(x)) = x$ and $f(g(x)) = x$

  There is no true inverse for $f(x) = x^2$, because it is not bijective.
* How are the graphs related
  The graph of an inverse function is reflected about $y = x$.
