docs/mathematics/single_variable_calculus/KBe21math401retFunctionsDefinition.tex
% Created 2021-09-11 Sat 16:43
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Exr0n}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Exr0n},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\section{What is a function?}
\label{sec:orgc4af04e}
A function \(f : D \to C\) is a unary operation that takes every element in the domain \(D\) to exactly one element in the codomain \(C\).

\(f(x) = x^2\) is a function over the domain of reals.
\section{A 1:1 function or injective function}
\label{sec:org85e9d5f}
A bijective function is a function \(f\) for which there exists a function \(g\) such that \(g\left(f(x)\right) = x\) for all \(x \in D\).
For every input, there is exactly one output, and for every output, there is exactly one input.

\(f(x) = x^2\) is not a 1:1 function, because both \(-1^2 = 1\) and \(1^2 = 1\).
\section{What is an inverse function}
\label{sec:orgf6dce53}
An inverse function \(g : C \to D\) is a function such that \(g(f(x)) = x\) and \(f(g(x)) = x\)

There is no true inverse for \(f(x) = x^2\), because it is not bijective.
\section{How are the graphs related}
\label{sec:org48ebdb7}
The graph of an inverse function is reflected about \(y = x\).
\end{document}
